app/views/users/index.html.erb

  <div>
    <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"