app/controllers/api/v1/friendships_controller.rb

      def show
        respond_with User.find(params[:id]).friends
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]

      def destroy
        respond_with User.find(params[:id]).friendships.find(params[:name])
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."id" = $2 LIMIT 1  [["user_id", 1], ["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]