app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
      def index
        respond_with User.all

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
      def destroy
        respond_with User.destroy(params[:id])