app/controllers/friendships_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT 1
---
  def index
    @users = User.all

INSERT INTO "friendships" ("created_at", "friend_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 20 Jan 2014 20:44:47 UTC +00:00], ["friend_id", 2], ["updated_at", Mon, 20 Jan 2014 20:44:47 UTC +00:00], ["user_id", 1]]
---
  def create
    @friendship = current_user.friendships.build(friend_id: params[:friend_id])
    if @friendship.save